# HasOrigin Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Hub..::..HasOrigin Method
Hub Class See Also
---
Provides information if Hub has a specific location at point in 3D space.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasOrigin()
```

Visual Basic
---
```text
Public Function HasOrigin As Boolean
```

Visual C++
---
```text
public:
bool HasOrigin()
```

# ### Return Value
True if the Hub has a specific location at point in 3D space.
# See Also
Hub Class
Autodesk.Revit.DB.Structure Namespace